_finddata32_t
\file        core/API.h
\file        core/Core.h
\brief       This is the main configuration header for the ADP Core library.
This header file should be included to determine the platform
setttings and internal configuration of the library.  Generally,
however, this file is automatically included by the interface headers.
\file        core/win32/Core.h
\brief       This is the Microsoft Windows configuration header for the ADP Core library.
This header file provides default definitions for build configuration macros.